tests/fixtures/responses/OrderStatus/basic.json

{
  "errorCode":"0",
  "errorMessage":"Success",
  "orderNumber":"301942",
  "orderStatus":2,
  "actionCode":0,
  "actionCodeDescription":"Request processed successfully",
  "amount":1000,
  "currency":"946",
  "date":1713957628364,
  "orderDescription":"Plata Maratonul Dragomirnei 2024 [#1713957440-584841]",
  "ip":"99.999.99.178",
  "merchantOrderParams":[
    {
      "name":"numberTime",
      "value":"16.961"
    },
    {
      "name":"FORCE_3DS2",
      "value":"true"
    },
    {
      "name":"discountedAmount"
    },
    {
      "name":"paymentTime",
      "value":"201.794"
    }
  ],
  "attributes":[
    {
      "name":"mdOrder",
      "value":"4b8a78e0-8752-40fe-a9bc-d4472b9768b8"
    }
  ],
  "cardAuthInfo":{
    "expiration":"202704",
    "cardholderName":"John Doe",
    "approvalCode":"582646",
    "pan":"999903**4444"
  },
  "authDateTime":1713957857011,
  "terminalId":"09999IER",
  "authRefNum":"444551023830",
  "paymentAmountInfo":{
    "paymentState":"DEPOSITED",
    "approvedAmount":1000,
    "depositedAmount":1000,
    "refundedAmount":0
  },
  "bankInfo":{
    "bankName":"ING BANK N.V. AMSTERDAM - BUCH",
    "bankCountryCode":"RO",
    "bankCountryName":"Romania"
  },
  "orderBundle":{
    "orderCreationDate":1713957628000,
    "customerDetails":{
      "email":"john@doe.com",
      "phone":"0741040219",
      "contact":"Gabriel Solomon",
      "billingInfo":{
        "country":"642",
        "city":"----",
        "postAddress":"Str. ....."
      }
    }
  },
  "chargeback":false,
  "cofOriginalTransactionId":"9998884499"
}